import React, { useState } from "react"

import { Feather } from "@expo/vector-icons"
import {
  View,
  Text,
  StyleSheet,
  TouchableOpacity,
  FlatList,
} from "react-native"
import Card from "./Card"

const DATA = [
  {
    id: 1,
    title: "Торговельна марка (TM)",
    text: "text",
  },
  {
    id: 2,
    title: "Авторські права",
    text: "Авторським правом захищаються твори науки, літератури та мистецтва. Фактично, ви отримуєте авторські права з моменту створення вами твору, проте на практиці дуже складно довести, що саме ви вперше створили той чи інший твір. Для цього українське законодавство передбачило процедуру – реєстрація авторського права.",
  },
  {
    id: 3,
    title: "Патенти",
    text: "Патент — це документ, що посвідчує виключне право автора на винахід протягом встановленого законом терміну (зазвичай від п’яти років до декількох десятиріч). По закінченню терміну захисту технічне рішення стає загальним надбанням. Законодавство передбачає поділ на три основні категорії: 1. Винаходи (корисні моделі) 2. Промислові зразки.",
  },
  {
    id: 4,
    title: "Франшиза",
    text: "Франшиза (франчайзинг) – це спосіб масштабування бізнесу та дуже популярна бізнес-модель в Україні та за кордоном. Власник відомого бренду, відомої торговельної марки або унікальної технології передає права на користування своєю інтелектуальною власністю. Тобто інші особи можуть отримати вже готовий бізнес, із репутацією, налаштованими процесами, базою клієнтів та постачальників.",
  },
  {
    id: 5,
    title: "Обслуговування бізнесу",
    text: "Ми надаємо комплекс послуг для бізнесу. У ньому міститься все, що потрібно для успішного та безпечного функціонування бізнесу. Наші клієнти зосереджуються на операційному управлінні та креативних ідеях, а ми надаємо цьому правильну форму. Ми пропонуємо як разові послуги, так і абонентське обслуговування бізнесу на постійній основі.",
  },
  {
    id: 6,
    title: "Договори",
    text: "Договори – це основа усіх ділових відносин. Правильно укладений договір допоможе зберегти ваші кошти, час та відносини з партнерами або клієнтами. Дуже часто власники бізнесу використовують договори з інтернету. Як результат – тривалі судові процеси, витрачені на адвоката кошти та відсутність гарантії справедливого рішення.",
  },
  {
    id: 7,
    title: "Нерухомість",
    text: "Кожному з нас потрібно орендувати квартиру, придбати будинок, орендувати приміщення для ведення бізнесу тощо. Для мінімізації ризиків при здійсненні будь-якої операції з нерухомістю обов’язково слід звертатися за допомогою до кваліфікованих юристів.",
  },
  {
    id: 8,
    title: "Судові справи",
    text: "Не завжди конфлікти можна вирішити шляхом переговорів. У такому випадку єдиним правильним рішенням є звернення до суду. Проте, результат розгляду судової справи та ухвалене судом рішення напряму залежить від правильності правової позиції та рівня адвоката. Наша компанія вирішує судові спори та допомагає клієнтам захистити свої права в суді.",
  },
  {
    id: 9,
    title: "Реєстрація ТОВ/ФОП/ГО/БФ",
    text: "Для ведення підприємницької діяльності потрібно обрати організаційно-правову форму. Наша компанія проаналізує ваш бізнес та надасть консультацію щодо цього питання.",
  },
  {
    id: 10,
    title: "ІТ-право",
    text: "Ми надаємо послуги з обслуговування ІТ-компаній та стартапів. Захист інтелектуальної власності, реєстрація компаній, регулювання відносин з працівниками, структурування податків, розробка договорів та супровід їх підписання.",
  },
]
function Cards() {
  const [toggle, setToggle] = useState("chevron-right")

  const handleToggle = () => {
    if (toggle === "chevron-down") return setToggle("chevron-right")
    if (toggle === "chevron-right") return setToggle("chevron-down")
  }

  return (
    <View>
      <Text style={styles.mainText}>
        Максимально швидко
        {"\n"}
        та якісно{" "}
        <Text
          style={{
            color: "tomato",
            fontStyle: "italic",
            fontWeight: "bold",
          }}
        >
          вирішимо{" "}
        </Text>
        будь-яке{" "}
        <Text
          style={{
            color: "tomato",
            fontStyle: "italic",
            fontWeight: "bold",
          }}
        >
          ваше питання
        </Text>
      </Text>
      {/*  */}
      {DATA.map((item) => {
        return <Card key={item.id} title={item.title} text={item.text} />
      })}
    </View>
  )
}

const styles = StyleSheet.create({
  mainText: {
    fontSize: 25,
    fontWeight: "bold",
    marginTop: 20,
    marginBottom: 30,
    padding: 10,
    borderWidth: 1,
    borderRadius: 10,
    borderColor: "tomato",
  },
  secondaryText: {
    fontSize: 20,
    lineHeight: 30,
  },
  card: {
    padding: 10,
    borderWidth: 1,
    borderRadius: 10,
    borderColor: "tomato",
    flexDirection: "row",
    justifyContent: "space-between",
    alignItems: "center",
    marginBottom: 20,
  },
})

export default Cards
